package config

import "github.com/Myriad-Dreamin/market/types"

var Cities = map[string]types.CityObject{
	"110100000000": {
		Province: "北京市",
		Name:     "市辖区",
		ID:       "110100000000",
	},
	"120100000000": {
		Province: "天津市",
		Name:     "市辖区",
		ID:       "120100000000",
	},
	"130100000000": {
		Province: "河北省",
		Name:     "石家庄市",
		ID:       "130100000000",
	},
	"130200000000": {
		Province: "河北省",
		Name:     "唐山市",
		ID:       "130200000000",
	},
	"130300000000": {
		Province: "河北省",
		Name:     "秦皇岛市",
		ID:       "130300000000",
	},
	"130400000000": {
		Province: "河北省",
		Name:     "邯郸市",
		ID:       "130400000000",
	},
	"130500000000": {
		Province: "河北省",
		Name:     "邢台市",
		ID:       "130500000000",
	},
	"130600000000": {
		Province: "河北省",
		Name:     "保定市",
		ID:       "130600000000",
	},
	"130700000000": {
		Province: "河北省",
		Name:     "张家口市",
		ID:       "130700000000",
	},
	"130800000000": {
		Province: "河北省",
		Name:     "承德市",
		ID:       "130800000000",
	},
	"130900000000": {
		Province: "河北省",
		Name:     "沧州市",
		ID:       "130900000000",
	},
	"131000000000": {
		Province: "河北省",
		Name:     "廊坊市",
		ID:       "131000000000",
	},
	"131100000000": {
		Province: "河北省",
		Name:     "衡水市",
		ID:       "131100000000",
	},
	"140100000000": {
		Province: "山西省",
		Name:     "太原市",
		ID:       "140100000000",
	},
	"140200000000": {
		Province: "山西省",
		Name:     "大同市",
		ID:       "140200000000",
	},
	"140300000000": {
		Province: "山西省",
		Name:     "阳泉市",
		ID:       "140300000000",
	},
	"140400000000": {
		Province: "山西省",
		Name:     "长治市",
		ID:       "140400000000",
	},
	"140500000000": {
		Province: "山西省",
		Name:     "晋城市",
		ID:       "140500000000",
	},
	"140600000000": {
		Province: "山西省",
		Name:     "朔州市",
		ID:       "140600000000",
	},
	"140700000000": {
		Province: "山西省",
		Name:     "晋中市",
		ID:       "140700000000",
	},
	"140800000000": {
		Province: "山西省",
		Name:     "运城市",
		ID:       "140800000000",
	},
	"140900000000": {
		Province: "山西省",
		Name:     "忻州市",
		ID:       "140900000000",
	},
	"141000000000": {
		Province: "山西省",
		Name:     "临汾市",
		ID:       "141000000000",
	},
	"141100000000": {
		Province: "山西省",
		Name:     "吕梁市",
		ID:       "141100000000",
	},
	"150100000000": {
		Province: "内蒙古自治区",
		Name:     "呼和浩特市",
		ID:       "150100000000",
	},
	"150200000000": {
		Province: "内蒙古自治区",
		Name:     "包头市",
		ID:       "150200000000",
	},
	"150300000000": {
		Province: "内蒙古自治区",
		Name:     "乌海市",
		ID:       "150300000000",
	},
	"150400000000": {
		Province: "内蒙古自治区",
		Name:     "赤峰市",
		ID:       "150400000000",
	},
	"150500000000": {
		Province: "内蒙古自治区",
		Name:     "通辽市",
		ID:       "150500000000",
	},
	"150600000000": {
		Province: "内蒙古自治区",
		Name:     "鄂尔多斯市",
		ID:       "150600000000",
	},
	"150700000000": {
		Province: "内蒙古自治区",
		Name:     "呼伦贝尔市",
		ID:       "150700000000",
	},
	"150800000000": {
		Province: "内蒙古自治区",
		Name:     "巴彦淖尔市",
		ID:       "150800000000",
	},
	"150900000000": {
		Province: "内蒙古自治区",
		Name:     "乌兰察布市",
		ID:       "150900000000",
	},
	"152200000000": {
		Province: "内蒙古自治区",
		Name:     "兴安盟",
		ID:       "152200000000",
	},
	"152500000000": {
		Province: "内蒙古自治区",
		Name:     "锡林郭勒盟",
		ID:       "152500000000",
	},
	"152900000000": {
		Province: "内蒙古自治区",
		Name:     "阿拉善盟",
		ID:       "152900000000",
	},
	"210100000000": {
		Province: "辽宁省",
		Name:     "沈阳市",
		ID:       "210100000000",
	},
	"210200000000": {
		Province: "辽宁省",
		Name:     "大连市",
		ID:       "210200000000",
	},
	"210300000000": {
		Province: "辽宁省",
		Name:     "鞍山市",
		ID:       "210300000000",
	},
	"210400000000": {
		Province: "辽宁省",
		Name:     "抚顺市",
		ID:       "210400000000",
	},
	"210500000000": {
		Province: "辽宁省",
		Name:     "本溪市",
		ID:       "210500000000",
	},
	"210600000000": {
		Province: "辽宁省",
		Name:     "丹东市",
		ID:       "210600000000",
	},
	"210700000000": {
		Province: "辽宁省",
		Name:     "锦州市",
		ID:       "210700000000",
	},
	"210800000000": {
		Province: "辽宁省",
		Name:     "营口市",
		ID:       "210800000000",
	},
	"210900000000": {
		Province: "辽宁省",
		Name:     "阜新市",
		ID:       "210900000000",
	},
	"211000000000": {
		Province: "辽宁省",
		Name:     "辽阳市",
		ID:       "211000000000",
	},
	"211100000000": {
		Province: "辽宁省",
		Name:     "盘锦市",
		ID:       "211100000000",
	},
	"211200000000": {
		Province: "辽宁省",
		Name:     "铁岭市",
		ID:       "211200000000",
	},
	"211300000000": {
		Province: "辽宁省",
		Name:     "朝阳市",
		ID:       "211300000000",
	},
	"211400000000": {
		Province: "辽宁省",
		Name:     "葫芦岛市",
		ID:       "211400000000",
	},
	"220100000000": {
		Province: "吉林省",
		Name:     "长春市",
		ID:       "220100000000",
	},
	"220200000000": {
		Province: "吉林省",
		Name:     "吉林市",
		ID:       "220200000000",
	},
	"220300000000": {
		Province: "吉林省",
		Name:     "四平市",
		ID:       "220300000000",
	},
	"220400000000": {
		Province: "吉林省",
		Name:     "辽源市",
		ID:       "220400000000",
	},
	"220500000000": {
		Province: "吉林省",
		Name:     "通化市",
		ID:       "220500000000",
	},
	"220600000000": {
		Province: "吉林省",
		Name:     "白山市",
		ID:       "220600000000",
	},
	"220700000000": {
		Province: "吉林省",
		Name:     "松原市",
		ID:       "220700000000",
	},
	"220800000000": {
		Province: "吉林省",
		Name:     "白城市",
		ID:       "220800000000",
	},
	"222400000000": {
		Province: "吉林省",
		Name:     "延边朝鲜族自治州",
		ID:       "222400000000",
	},
	"230100000000": {
		Province: "黑龙江省",
		Name:     "哈尔滨市",
		ID:       "230100000000",
	},
	"230200000000": {
		Province: "黑龙江省",
		Name:     "齐齐哈尔市",
		ID:       "230200000000",
	},
	"230300000000": {
		Province: "黑龙江省",
		Name:     "鸡西市",
		ID:       "230300000000",
	},
	"230400000000": {
		Province: "黑龙江省",
		Name:     "鹤岗市",
		ID:       "230400000000",
	},
	"230500000000": {
		Province: "黑龙江省",
		Name:     "双鸭山市",
		ID:       "230500000000",
	},
	"230600000000": {
		Province: "黑龙江省",
		Name:     "大庆市",
		ID:       "230600000000",
	},
	"230700000000": {
		Province: "黑龙江省",
		Name:     "伊春市",
		ID:       "230700000000",
	},
	"230800000000": {
		Province: "黑龙江省",
		Name:     "佳木斯市",
		ID:       "230800000000",
	},
	"230900000000": {
		Province: "黑龙江省",
		Name:     "七台河市",
		ID:       "230900000000",
	},
	"231000000000": {
		Province: "黑龙江省",
		Name:     "牡丹江市",
		ID:       "231000000000",
	},
	"231100000000": {
		Province: "黑龙江省",
		Name:     "黑河市",
		ID:       "231100000000",
	},
	"231200000000": {
		Province: "黑龙江省",
		Name:     "绥化市",
		ID:       "231200000000",
	},
	"232700000000": {
		Province: "黑龙江省",
		Name:     "大兴安岭地区",
		ID:       "232700000000",
	},
	"310100000000": {
		Province: "上海市",
		Name:     "市辖区",
		ID:       "310100000000",
	},
	"320100000000": {
		Province: "江苏省",
		Name:     "南京市",
		ID:       "320100000000",
	},
	"320200000000": {
		Province: "江苏省",
		Name:     "无锡市",
		ID:       "320200000000",
	},
	"320300000000": {
		Province: "江苏省",
		Name:     "徐州市",
		ID:       "320300000000",
	},
	"320400000000": {
		Province: "江苏省",
		Name:     "常州市",
		ID:       "320400000000",
	},
	"320500000000": {
		Province: "江苏省",
		Name:     "苏州市",
		ID:       "320500000000",
	},
	"320600000000": {
		Province: "江苏省",
		Name:     "南通市",
		ID:       "320600000000",
	},
	"320700000000": {
		Province: "江苏省",
		Name:     "连云港市",
		ID:       "320700000000",
	},
	"320800000000": {
		Province: "江苏省",
		Name:     "淮安市",
		ID:       "320800000000",
	},
	"320900000000": {
		Province: "江苏省",
		Name:     "盐城市",
		ID:       "320900000000",
	},
	"321000000000": {
		Province: "江苏省",
		Name:     "扬州市",
		ID:       "321000000000",
	},
	"321100000000": {
		Province: "江苏省",
		Name:     "镇江市",
		ID:       "321100000000",
	},
	"321200000000": {
		Province: "江苏省",
		Name:     "泰州市",
		ID:       "321200000000",
	},
	"321300000000": {
		Province: "江苏省",
		Name:     "宿迁市",
		ID:       "321300000000",
	},
	"330100000000": {
		Province: "浙江省",
		Name:     "杭州市",
		ID:       "330100000000",
	},
	"330200000000": {
		Province: "浙江省",
		Name:     "宁波市",
		ID:       "330200000000",
	},
	"330300000000": {
		Province: "浙江省",
		Name:     "温州市",
		ID:       "330300000000",
	},
	"330400000000": {
		Province: "浙江省",
		Name:     "嘉兴市",
		ID:       "330400000000",
	},
	"330500000000": {
		Province: "浙江省",
		Name:     "湖州市",
		ID:       "330500000000",
	},
	"330600000000": {
		Province: "浙江省",
		Name:     "绍兴市",
		ID:       "330600000000",
	},
	"330700000000": {
		Province: "浙江省",
		Name:     "金华市",
		ID:       "330700000000",
	},
	"330800000000": {
		Province: "浙江省",
		Name:     "衢州市",
		ID:       "330800000000",
	},
	"330900000000": {
		Province: "浙江省",
		Name:     "舟山市",
		ID:       "330900000000",
	},
	"331000000000": {
		Province: "浙江省",
		Name:     "台州市",
		ID:       "331000000000",
	},
	"331100000000": {
		Province: "浙江省",
		Name:     "丽水市",
		ID:       "331100000000",
	},
	"340100000000": {
		Province: "安徽省",
		Name:     "合肥市",
		ID:       "340100000000",
	},
	"340200000000": {
		Province: "安徽省",
		Name:     "芜湖市",
		ID:       "340200000000",
	},
	"340300000000": {
		Province: "安徽省",
		Name:     "蚌埠市",
		ID:       "340300000000",
	},
	"340400000000": {
		Province: "安徽省",
		Name:     "淮南市",
		ID:       "340400000000",
	},
	"340500000000": {
		Province: "安徽省",
		Name:     "马鞍山市",
		ID:       "340500000000",
	},
	"340600000000": {
		Province: "安徽省",
		Name:     "淮北市",
		ID:       "340600000000",
	},
	"340700000000": {
		Province: "安徽省",
		Name:     "铜陵市",
		ID:       "340700000000",
	},
	"340800000000": {
		Province: "安徽省",
		Name:     "安庆市",
		ID:       "340800000000",
	},
	"341000000000": {
		Province: "安徽省",
		Name:     "黄山市",
		ID:       "341000000000",
	},
	"341100000000": {
		Province: "安徽省",
		Name:     "滁州市",
		ID:       "341100000000",
	},
	"341200000000": {
		Province: "安徽省",
		Name:     "阜阳市",
		ID:       "341200000000",
	},
	"341300000000": {
		Province: "安徽省",
		Name:     "宿州市",
		ID:       "341300000000",
	},
	"341500000000": {
		Province: "安徽省",
		Name:     "六安市",
		ID:       "341500000000",
	},
	"341600000000": {
		Province: "安徽省",
		Name:     "亳州市",
		ID:       "341600000000",
	},
	"341700000000": {
		Province: "安徽省",
		Name:     "池州市",
		ID:       "341700000000",
	},
	"341800000000": {
		Province: "安徽省",
		Name:     "宣城市",
		ID:       "341800000000",
	},
	"350100000000": {
		Province: "福建省",
		Name:     "福州市",
		ID:       "350100000000",
	},
	"350200000000": {
		Province: "福建省",
		Name:     "厦门市",
		ID:       "350200000000",
	},
	"350300000000": {
		Province: "福建省",
		Name:     "莆田市",
		ID:       "350300000000",
	},
	"350400000000": {
		Province: "福建省",
		Name:     "三明市",
		ID:       "350400000000",
	},
	"350500000000": {
		Province: "福建省",
		Name:     "泉州市",
		ID:       "350500000000",
	},
	"350600000000": {
		Province: "福建省",
		Name:     "漳州市",
		ID:       "350600000000",
	},
	"350700000000": {
		Province: "福建省",
		Name:     "南平市",
		ID:       "350700000000",
	},
	"350800000000": {
		Province: "福建省",
		Name:     "龙岩市",
		ID:       "350800000000",
	},
	"350900000000": {
		Province: "福建省",
		Name:     "宁德市",
		ID:       "350900000000",
	},
	"360100000000": {
		Province: "江西省",
		Name:     "南昌市",
		ID:       "360100000000",
	},
	"360200000000": {
		Province: "江西省",
		Name:     "景德镇市",
		ID:       "360200000000",
	},
	"360300000000": {
		Province: "江西省",
		Name:     "萍乡市",
		ID:       "360300000000",
	},
	"360400000000": {
		Province: "江西省",
		Name:     "九江市",
		ID:       "360400000000",
	},
	"360500000000": {
		Province: "江西省",
		Name:     "新余市",
		ID:       "360500000000",
	},
	"360600000000": {
		Province: "江西省",
		Name:     "鹰潭市",
		ID:       "360600000000",
	},
	"360700000000": {
		Province: "江西省",
		Name:     "赣州市",
		ID:       "360700000000",
	},
	"360800000000": {
		Province: "江西省",
		Name:     "吉安市",
		ID:       "360800000000",
	},
	"360900000000": {
		Province: "江西省",
		Name:     "宜春市",
		ID:       "360900000000",
	},
	"361000000000": {
		Province: "江西省",
		Name:     "抚州市",
		ID:       "361000000000",
	},
	"361100000000": {
		Province: "江西省",
		Name:     "上饶市",
		ID:       "361100000000",
	},
	"370100000000": {
		Province: "山东省",
		Name:     "济南市",
		ID:       "370100000000",
	},
	"370200000000": {
		Province: "山东省",
		Name:     "青岛市",
		ID:       "370200000000",
	},
	"370300000000": {
		Province: "山东省",
		Name:     "淄博市",
		ID:       "370300000000",
	},
	"370400000000": {
		Province: "山东省",
		Name:     "枣庄市",
		ID:       "370400000000",
	},
	"370500000000": {
		Province: "山东省",
		Name:     "东营市",
		ID:       "370500000000",
	},
	"370600000000": {
		Province: "山东省",
		Name:     "烟台市",
		ID:       "370600000000",
	},
	"370700000000": {
		Province: "山东省",
		Name:     "潍坊市",
		ID:       "370700000000",
	},
	"370800000000": {
		Province: "山东省",
		Name:     "济宁市",
		ID:       "370800000000",
	},
	"370900000000": {
		Province: "山东省",
		Name:     "泰安市",
		ID:       "370900000000",
	},
	"371000000000": {
		Province: "山东省",
		Name:     "威海市",
		ID:       "371000000000",
	},
	"371100000000": {
		Province: "山东省",
		Name:     "日照市",
		ID:       "371100000000",
	},
	"371200000000": {
		Province: "山东省",
		Name:     "莱芜市",
		ID:       "371200000000",
	},
	"371300000000": {
		Province: "山东省",
		Name:     "临沂市",
		ID:       "371300000000",
	},
	"371400000000": {
		Province: "山东省",
		Name:     "德州市",
		ID:       "371400000000",
	},
	"371500000000": {
		Province: "山东省",
		Name:     "聊城市",
		ID:       "371500000000",
	},
	"371600000000": {
		Province: "山东省",
		Name:     "滨州市",
		ID:       "371600000000",
	},
	"371700000000": {
		Province: "山东省",
		Name:     "菏泽市",
		ID:       "371700000000",
	},
	"410100000000": {
		Province: "河南省",
		Name:     "郑州市",
		ID:       "410100000000",
	},
	"410200000000": {
		Province: "河南省",
		Name:     "开封市",
		ID:       "410200000000",
	},
	"410300000000": {
		Province: "河南省",
		Name:     "洛阳市",
		ID:       "410300000000",
	},
	"410400000000": {
		Province: "河南省",
		Name:     "平顶山市",
		ID:       "410400000000",
	},
	"410500000000": {
		Province: "河南省",
		Name:     "安阳市",
		ID:       "410500000000",
	},
	"410600000000": {
		Province: "河南省",
		Name:     "鹤壁市",
		ID:       "410600000000",
	},
	"410700000000": {
		Province: "河南省",
		Name:     "新乡市",
		ID:       "410700000000",
	},
	"410800000000": {
		Province: "河南省",
		Name:     "焦作市",
		ID:       "410800000000",
	},
	"410900000000": {
		Province: "河南省",
		Name:     "濮阳市",
		ID:       "410900000000",
	},
	"411000000000": {
		Province: "河南省",
		Name:     "许昌市",
		ID:       "411000000000",
	},
	"411100000000": {
		Province: "河南省",
		Name:     "漯河市",
		ID:       "411100000000",
	},
	"411200000000": {
		Province: "河南省",
		Name:     "三门峡市",
		ID:       "411200000000",
	},
	"411300000000": {
		Province: "河南省",
		Name:     "南阳市",
		ID:       "411300000000",
	},
	"411400000000": {
		Province: "河南省",
		Name:     "商丘市",
		ID:       "411400000000",
	},
	"411500000000": {
		Province: "河南省",
		Name:     "信阳市",
		ID:       "411500000000",
	},
	"411600000000": {
		Province: "河南省",
		Name:     "周口市",
		ID:       "411600000000",
	},
	"411700000000": {
		Province: "河南省",
		Name:     "驻马店市",
		ID:       "411700000000",
	},
	"419000000000": {
		Province: "河南省",
		Name:     "省直辖县级行政区划",
		ID:       "419000000000",
	},
	"420100000000": {
		Province: "湖北省",
		Name:     "武汉市",
		ID:       "420100000000",
	},
	"420200000000": {
		Province: "湖北省",
		Name:     "黄石市",
		ID:       "420200000000",
	},
	"420300000000": {
		Province: "湖北省",
		Name:     "十堰市",
		ID:       "420300000000",
	},
	"420500000000": {
		Province: "湖北省",
		Name:     "宜昌市",
		ID:       "420500000000",
	},
	"420600000000": {
		Province: "湖北省",
		Name:     "襄阳市",
		ID:       "420600000000",
	},
	"420700000000": {
		Province: "湖北省",
		Name:     "鄂州市",
		ID:       "420700000000",
	},
	"420800000000": {
		Province: "湖北省",
		Name:     "荆门市",
		ID:       "420800000000",
	},
	"420900000000": {
		Province: "湖北省",
		Name:     "孝感市",
		ID:       "420900000000",
	},
	"421000000000": {
		Province: "湖北省",
		Name:     "荆州市",
		ID:       "421000000000",
	},
	"421100000000": {
		Province: "湖北省",
		Name:     "黄冈市",
		ID:       "421100000000",
	},
	"421200000000": {
		Province: "湖北省",
		Name:     "咸宁市",
		ID:       "421200000000",
	},
	"421300000000": {
		Province: "湖北省",
		Name:     "随州市",
		ID:       "421300000000",
	},
	"422800000000": {
		Province: "湖北省",
		Name:     "恩施土家族苗族自治州",
		ID:       "422800000000",
	},
	"429000000000": {
		Province: "湖北省",
		Name:     "省直辖县级行政区划",
		ID:       "429000000000",
	},
	"430100000000": {
		Province: "湖南省",
		Name:     "长沙市",
		ID:       "430100000000",
	},
	"430200000000": {
		Province: "湖南省",
		Name:     "株洲市",
		ID:       "430200000000",
	},
	"430300000000": {
		Province: "湖南省",
		Name:     "湘潭市",
		ID:       "430300000000",
	},
	"430400000000": {
		Province: "湖南省",
		Name:     "衡阳市",
		ID:       "430400000000",
	},
	"430500000000": {
		Province: "湖南省",
		Name:     "邵阳市",
		ID:       "430500000000",
	},
	"430600000000": {
		Province: "湖南省",
		Name:     "岳阳市",
		ID:       "430600000000",
	},
	"430700000000": {
		Province: "湖南省",
		Name:     "常德市",
		ID:       "430700000000",
	},
	"430800000000": {
		Province: "湖南省",
		Name:     "张家界市",
		ID:       "430800000000",
	},
	"430900000000": {
		Province: "湖南省",
		Name:     "益阳市",
		ID:       "430900000000",
	},
	"431000000000": {
		Province: "湖南省",
		Name:     "郴州市",
		ID:       "431000000000",
	},
	"431100000000": {
		Province: "湖南省",
		Name:     "永州市",
		ID:       "431100000000",
	},
	"431200000000": {
		Province: "湖南省",
		Name:     "怀化市",
		ID:       "431200000000",
	},
	"431300000000": {
		Province: "湖南省",
		Name:     "娄底市",
		ID:       "431300000000",
	},
	"433100000000": {
		Province: "湖南省",
		Name:     "湘西土家族苗族自治州",
		ID:       "433100000000",
	},
	"440100000000": {
		Province: "广东省",
		Name:     "广州市",
		ID:       "440100000000",
	},
	"440200000000": {
		Province: "广东省",
		Name:     "韶关市",
		ID:       "440200000000",
	},
	"440300000000": {
		Province: "广东省",
		Name:     "深圳市",
		ID:       "440300000000",
	},
	"440400000000": {
		Province: "广东省",
		Name:     "珠海市",
		ID:       "440400000000",
	},
	"440500000000": {
		Province: "广东省",
		Name:     "汕头市",
		ID:       "440500000000",
	},
	"440600000000": {
		Province: "广东省",
		Name:     "佛山市",
		ID:       "440600000000",
	},
	"440700000000": {
		Province: "广东省",
		Name:     "江门市",
		ID:       "440700000000",
	},
	"440800000000": {
		Province: "广东省",
		Name:     "湛江市",
		ID:       "440800000000",
	},
	"440900000000": {
		Province: "广东省",
		Name:     "茂名市",
		ID:       "440900000000",
	},
	"441200000000": {
		Province: "广东省",
		Name:     "肇庆市",
		ID:       "441200000000",
	},
	"441300000000": {
		Province: "广东省",
		Name:     "惠州市",
		ID:       "441300000000",
	},
	"441400000000": {
		Province: "广东省",
		Name:     "梅州市",
		ID:       "441400000000",
	},
	"441500000000": {
		Province: "广东省",
		Name:     "汕尾市",
		ID:       "441500000000",
	},
	"441600000000": {
		Province: "广东省",
		Name:     "河源市",
		ID:       "441600000000",
	},
	"441700000000": {
		Province: "广东省",
		Name:     "阳江市",
		ID:       "441700000000",
	},
	"441800000000": {
		Province: "广东省",
		Name:     "清远市",
		ID:       "441800000000",
	},
	"441900000000": {
		Province: "广东省",
		Name:     "东莞市",
		ID:       "441900000000",
	},
	"442000000000": {
		Province: "广东省",
		Name:     "中山市",
		ID:       "442000000000",
	},
	"445100000000": {
		Province: "广东省",
		Name:     "潮州市",
		ID:       "445100000000",
	},
	"445200000000": {
		Province: "广东省",
		Name:     "揭阳市",
		ID:       "445200000000",
	},
	"445300000000": {
		Province: "广东省",
		Name:     "云浮市",
		ID:       "445300000000",
	},
	"450100000000": {
		Province: "广西壮族自治区",
		Name:     "南宁市",
		ID:       "450100000000",
	},
	"450200000000": {
		Province: "广西壮族自治区",
		Name:     "柳州市",
		ID:       "450200000000",
	},
	"450300000000": {
		Province: "广西壮族自治区",
		Name:     "桂林市",
		ID:       "450300000000",
	},
	"450400000000": {
		Province: "广西壮族自治区",
		Name:     "梧州市",
		ID:       "450400000000",
	},
	"450500000000": {
		Province: "广西壮族自治区",
		Name:     "北海市",
		ID:       "450500000000",
	},
	"450600000000": {
		Province: "广西壮族自治区",
		Name:     "防城港市",
		ID:       "450600000000",
	},
	"450700000000": {
		Province: "广西壮族自治区",
		Name:     "钦州市",
		ID:       "450700000000",
	},
	"450800000000": {
		Province: "广西壮族自治区",
		Name:     "贵港市",
		ID:       "450800000000",
	},
	"450900000000": {
		Province: "广西壮族自治区",
		Name:     "玉林市",
		ID:       "450900000000",
	},
	"451000000000": {
		Province: "广西壮族自治区",
		Name:     "百色市",
		ID:       "451000000000",
	},
	"451100000000": {
		Province: "广西壮族自治区",
		Name:     "贺州市",
		ID:       "451100000000",
	},
	"451200000000": {
		Province: "广西壮族自治区",
		Name:     "河池市",
		ID:       "451200000000",
	},
	"451300000000": {
		Province: "广西壮族自治区",
		Name:     "来宾市",
		ID:       "451300000000",
	},
	"451400000000": {
		Province: "广西壮族自治区",
		Name:     "崇左市",
		ID:       "451400000000",
	},
	"460100000000": {
		Province: "海南省",
		Name:     "海口市",
		ID:       "460100000000",
	},
	"460200000000": {
		Province: "海南省",
		Name:     "三亚市",
		ID:       "460200000000",
	},
	"460300000000": {
		Province: "海南省",
		Name:     "三沙市",
		ID:       "460300000000",
	},
	"460400000000": {
		Province: "海南省",
		Name:     "儋州市",
		ID:       "460400000000",
	},
	"469000000000": {
		Province: "海南省",
		Name:     "省直辖县级行政区划",
		ID:       "469000000000",
	},
	"500100000000": {
		Province: "重庆市",
		Name:     "市辖区",
		ID:       "500100000000",
	},
	"500200000000": {
		Province: "重庆市",
		Name:     "县",
		ID:       "500200000000",
	},
	"510100000000": {
		Province: "四川省",
		Name:     "成都市",
		ID:       "510100000000",
	},
	"510300000000": {
		Province: "四川省",
		Name:     "自贡市",
		ID:       "510300000000",
	},
	"510400000000": {
		Province: "四川省",
		Name:     "攀枝花市",
		ID:       "510400000000",
	},
	"510500000000": {
		Province: "四川省",
		Name:     "泸州市",
		ID:       "510500000000",
	},
	"510600000000": {
		Province: "四川省",
		Name:     "德阳市",
		ID:       "510600000000",
	},
	"510700000000": {
		Province: "四川省",
		Name:     "绵阳市",
		ID:       "510700000000",
	},
	"510800000000": {
		Province: "四川省",
		Name:     "广元市",
		ID:       "510800000000",
	},
	"510900000000": {
		Province: "四川省",
		Name:     "遂宁市",
		ID:       "510900000000",
	},
	"511000000000": {
		Province: "四川省",
		Name:     "内江市",
		ID:       "511000000000",
	},
	"511100000000": {
		Province: "四川省",
		Name:     "乐山市",
		ID:       "511100000000",
	},
	"511300000000": {
		Province: "四川省",
		Name:     "南充市",
		ID:       "511300000000",
	},
	"511400000000": {
		Province: "四川省",
		Name:     "眉山市",
		ID:       "511400000000",
	},
	"511500000000": {
		Province: "四川省",
		Name:     "宜宾市",
		ID:       "511500000000",
	},
	"511600000000": {
		Province: "四川省",
		Name:     "广安市",
		ID:       "511600000000",
	},
	"511700000000": {
		Province: "四川省",
		Name:     "达州市",
		ID:       "511700000000",
	},
	"511800000000": {
		Province: "四川省",
		Name:     "雅安市",
		ID:       "511800000000",
	},
	"511900000000": {
		Province: "四川省",
		Name:     "巴中市",
		ID:       "511900000000",
	},
	"512000000000": {
		Province: "四川省",
		Name:     "资阳市",
		ID:       "512000000000",
	},
	"513200000000": {
		Province: "四川省",
		Name:     "阿坝藏族羌族自治州",
		ID:       "513200000000",
	},
	"513300000000": {
		Province: "四川省",
		Name:     "甘孜藏族自治州",
		ID:       "513300000000",
	},
	"513400000000": {
		Province: "四川省",
		Name:     "凉山彝族自治州",
		ID:       "513400000000",
	},
	"520100000000": {
		Province: "贵州省",
		Name:     "贵阳市",
		ID:       "520100000000",
	},
	"520200000000": {
		Province: "贵州省",
		Name:     "六盘水市",
		ID:       "520200000000",
	},
	"520300000000": {
		Province: "贵州省",
		Name:     "遵义市",
		ID:       "520300000000",
	},
	"520400000000": {
		Province: "贵州省",
		Name:     "安顺市",
		ID:       "520400000000",
	},
	"520500000000": {
		Province: "贵州省",
		Name:     "毕节市",
		ID:       "520500000000",
	},
	"520600000000": {
		Province: "贵州省",
		Name:     "铜仁市",
		ID:       "520600000000",
	},
	"522300000000": {
		Province: "贵州省",
		Name:     "黔西南布依族苗族自治州",
		ID:       "522300000000",
	},
	"522600000000": {
		Province: "贵州省",
		Name:     "黔东南苗族侗族自治州",
		ID:       "522600000000",
	},
	"522700000000": {
		Province: "贵州省",
		Name:     "黔南布依族苗族自治州",
		ID:       "522700000000",
	},
	"530100000000": {
		Province: "云南省",
		Name:     "昆明市",
		ID:       "530100000000",
	},
	"530300000000": {
		Province: "云南省",
		Name:     "曲靖市",
		ID:       "530300000000",
	},
	"530400000000": {
		Province: "云南省",
		Name:     "玉溪市",
		ID:       "530400000000",
	},
	"530500000000": {
		Province: "云南省",
		Name:     "保山市",
		ID:       "530500000000",
	},
	"530600000000": {
		Province: "云南省",
		Name:     "昭通市",
		ID:       "530600000000",
	},
	"530700000000": {
		Province: "云南省",
		Name:     "丽江市",
		ID:       "530700000000",
	},
	"530800000000": {
		Province: "云南省",
		Name:     "普洱市",
		ID:       "530800000000",
	},
	"530900000000": {
		Province: "云南省",
		Name:     "临沧市",
		ID:       "530900000000",
	},
	"532300000000": {
		Province: "云南省",
		Name:     "楚雄彝族自治州",
		ID:       "532300000000",
	},
	"532500000000": {
		Province: "云南省",
		Name:     "红河哈尼族彝族自治州",
		ID:       "532500000000",
	},
	"532600000000": {
		Province: "云南省",
		Name:     "文山壮族苗族自治州",
		ID:       "532600000000",
	},
	"532800000000": {
		Province: "云南省",
		Name:     "西双版纳傣族自治州",
		ID:       "532800000000",
	},
	"532900000000": {
		Province: "云南省",
		Name:     "大理白族自治州",
		ID:       "532900000000",
	},
	"533100000000": {
		Province: "云南省",
		Name:     "德宏傣族景颇族自治州",
		ID:       "533100000000",
	},
	"533300000000": {
		Province: "云南省",
		Name:     "怒江傈僳族自治州",
		ID:       "533300000000",
	},
	"533400000000": {
		Province: "云南省",
		Name:     "迪庆藏族自治州",
		ID:       "533400000000",
	},
	"540100000000": {
		Province: "西藏自治区",
		Name:     "拉萨市",
		ID:       "540100000000",
	},
	"540200000000": {
		Province: "西藏自治区",
		Name:     "日喀则市",
		ID:       "540200000000",
	},
	"540300000000": {
		Province: "西藏自治区",
		Name:     "昌都市",
		ID:       "540300000000",
	},
	"540400000000": {
		Province: "西藏自治区",
		Name:     "林芝市",
		ID:       "540400000000",
	},
	"540500000000": {
		Province: "西藏自治区",
		Name:     "山南市",
		ID:       "540500000000",
	},
	"540600000000": {
		Province: "西藏自治区",
		Name:     "那曲市",
		ID:       "540600000000",
	},
	"542500000000": {
		Province: "西藏自治区",
		Name:     "阿里地区",
		ID:       "542500000000",
	},
	"610100000000": {
		Province: "陕西省",
		Name:     "西安市",
		ID:       "610100000000",
	},
	"610200000000": {
		Province: "陕西省",
		Name:     "铜川市",
		ID:       "610200000000",
	},
	"610300000000": {
		Province: "陕西省",
		Name:     "宝鸡市",
		ID:       "610300000000",
	},
	"610400000000": {
		Province: "陕西省",
		Name:     "咸阳市",
		ID:       "610400000000",
	},
	"610500000000": {
		Province: "陕西省",
		Name:     "渭南市",
		ID:       "610500000000",
	},
	"610600000000": {
		Province: "陕西省",
		Name:     "延安市",
		ID:       "610600000000",
	},
	"610700000000": {
		Province: "陕西省",
		Name:     "汉中市",
		ID:       "610700000000",
	},
	"610800000000": {
		Province: "陕西省",
		Name:     "榆林市",
		ID:       "610800000000",
	},
	"610900000000": {
		Province: "陕西省",
		Name:     "安康市",
		ID:       "610900000000",
	},
	"611000000000": {
		Province: "陕西省",
		Name:     "商洛市",
		ID:       "611000000000",
	},
	"620100000000": {
		Province: "甘肃省",
		Name:     "兰州市",
		ID:       "620100000000",
	},
	"620200000000": {
		Province: "甘肃省",
		Name:     "嘉峪关市",
		ID:       "620200000000",
	},
	"620300000000": {
		Province: "甘肃省",
		Name:     "金昌市",
		ID:       "620300000000",
	},
	"620400000000": {
		Province: "甘肃省",
		Name:     "白银市",
		ID:       "620400000000",
	},
	"620500000000": {
		Province: "甘肃省",
		Name:     "天水市",
		ID:       "620500000000",
	},
	"620600000000": {
		Province: "甘肃省",
		Name:     "武威市",
		ID:       "620600000000",
	},
	"620700000000": {
		Province: "甘肃省",
		Name:     "张掖市",
		ID:       "620700000000",
	},
	"620800000000": {
		Province: "甘肃省",
		Name:     "平凉市",
		ID:       "620800000000",
	},
	"620900000000": {
		Province: "甘肃省",
		Name:     "酒泉市",
		ID:       "620900000000",
	},
	"621000000000": {
		Province: "甘肃省",
		Name:     "庆阳市",
		ID:       "621000000000",
	},
	"621100000000": {
		Province: "甘肃省",
		Name:     "定西市",
		ID:       "621100000000",
	},
	"621200000000": {
		Province: "甘肃省",
		Name:     "陇南市",
		ID:       "621200000000",
	},
	"622900000000": {
		Province: "甘肃省",
		Name:     "临夏回族自治州",
		ID:       "622900000000",
	},
	"623000000000": {
		Province: "甘肃省",
		Name:     "甘南藏族自治州",
		ID:       "623000000000",
	},
	"630100000000": {
		Province: "青海省",
		Name:     "西宁市",
		ID:       "630100000000",
	},
	"630200000000": {
		Province: "青海省",
		Name:     "海东市",
		ID:       "630200000000",
	},
	"632200000000": {
		Province: "青海省",
		Name:     "海北藏族自治州",
		ID:       "632200000000",
	},
	"632300000000": {
		Province: "青海省",
		Name:     "黄南藏族自治州",
		ID:       "632300000000",
	},
	"632500000000": {
		Province: "青海省",
		Name:     "海南藏族自治州",
		ID:       "632500000000",
	},
	"632600000000": {
		Province: "青海省",
		Name:     "果洛藏族自治州",
		ID:       "632600000000",
	},
	"632700000000": {
		Province: "青海省",
		Name:     "玉树藏族自治州",
		ID:       "632700000000",
	},
	"632800000000": {
		Province: "青海省",
		Name:     "海西蒙古族藏族自治州",
		ID:       "632800000000",
	},
	"640100000000": {
		Province: "宁夏回族自治区",
		Name:     "银川市",
		ID:       "640100000000",
	},
	"640200000000": {
		Province: "宁夏回族自治区",
		Name:     "石嘴山市",
		ID:       "640200000000",
	},
	"640300000000": {
		Province: "宁夏回族自治区",
		Name:     "吴忠市",
		ID:       "640300000000",
	},
	"640400000000": {
		Province: "宁夏回族自治区",
		Name:     "固原市",
		ID:       "640400000000",
	},
	"640500000000": {
		Province: "宁夏回族自治区",
		Name:     "中卫市",
		ID:       "640500000000",
	},
	"650100000000": {
		Province: "新疆维吾尔自治区",
		Name:     "乌鲁木齐市",
		ID:       "650100000000",
	},
	"650200000000": {
		Province: "新疆维吾尔自治区",
		Name:     "克拉玛依市",
		ID:       "650200000000",
	},
	"650400000000": {
		Province: "新疆维吾尔自治区",
		Name:     "吐鲁番市",
		ID:       "650400000000",
	},
	"650500000000": {
		Province: "新疆维吾尔自治区",
		Name:     "哈密市",
		ID:       "650500000000",
	},
	"652300000000": {
		Province: "新疆维吾尔自治区",
		Name:     "昌吉回族自治州",
		ID:       "652300000000",
	},
	"652700000000": {
		Province: "新疆维吾尔自治区",
		Name:     "博尔塔拉蒙古自治州",
		ID:       "652700000000",
	},
	"652800000000": {
		Province: "新疆维吾尔自治区",
		Name:     "巴音郭楞蒙古自治州",
		ID:       "652800000000",
	},
	"652900000000": {
		Province: "新疆维吾尔自治区",
		Name:     "阿克苏地区",
		ID:       "652900000000",
	},
	"653000000000": {
		Province: "新疆维吾尔自治区",
		Name:     "克孜勒苏柯尔克孜自治州",
		ID:       "653000000000",
	},
	"653100000000": {
		Province: "新疆维吾尔自治区",
		Name:     "喀什地区",
		ID:       "653100000000",
	},
	"653200000000": {
		Province: "新疆维吾尔自治区",
		Name:     "和田地区",
		ID:       "653200000000",
	},
	"654000000000": {
		Province: "新疆维吾尔自治区",
		Name:     "伊犁哈萨克自治州",
		ID:       "654000000000",
	},
	"654200000000": {
		Province: "新疆维吾尔自治区",
		Name:     "塔城地区",
		ID:       "654200000000",
	},
	"654300000000": {
		Province: "新疆维吾尔自治区",
		Name:     "阿勒泰地区",
		ID:       "654300000000",
	},
	"659000000000": {
		Province: "新疆维吾尔自治区",
		Name:     "自治区直辖县级行政区划",
		ID:       "659000000000",
	},
}
